[{"title":"bitcashBank","description":"Bitcash allows users to buy, trade, deposit, and earn on cryptocurrencies, with a focus on exchanging funds for local currency stablecoins or bitUSD. The platform also features BitcashDAO for community-based decision-making.\n At Bitcash, my role from the start focused on infrastructure design, tech recruitment, and developer training. I later transitioned to a consulting role to guide the platform's continuous adaptation and success.","technologies":["Antelope","Smart Contracts","ReactJS","Containers","GCloud","NodeJS","GraphQL","PostgreSQL","TypeScript"],"link":"https://bitcash.org","image":"https://gaboesquivel.com/images/work/bitcash-bank.png","video":"https://www.youtube.com/watch?v=2JuHy_w0Ct4","repo":"https://github.com/bitcashorg"},{"title":"ZTX","description":"ZTX, a web3 metaverse platform, enables creators to build, play, and earn. Supported by Jump Crypto and ZEPETO, it integrates blockchain for NFT trading.\n As a software consultant in the early stages of ZTX, I was instrumental in developing the NFT marketplace and establishing a link between the WebGL metaverse and EVM technologies.","technologies":["WebGL","Ethereum","Ethers","AWS","Node.js","ReactJS","NextJS"],"link":"https://ztx.io","image":"https://gaboesquivel.com/images/work/ztx.png","video":"https://www.youtube.com/watch?v=h58y6UzZ7RA"},{"title":"RareMint","description":"RareMint digitizes real-world sports collectibles as NFTs, offering a digital collectible experience.\n I led technical efforts at RareMint to enhance the NFT marketplace's performance and maintainability. Additionally, I supported integrating the platform with the Polygon network for auctions.","technologies":["Ethereum","Polygon","Ethers","React","Containers","GCloud","NodeJS","GraphQL","TypeScript"],"link":"https://raremint.com","image":"https://gaboesquivel.com/images/work/raremint.png","video":"https://www.youtube.com/watch?v=2wh32w7N9xg"},{"title":"Emanate","description":"Emanate is a Web3-powered network marketplace for the music industry, streamlining music creation, distribution, and monetization.\n At Emanate, I developed the ReactJS web app streaming platform and the back office for artist revenue distribution, contributing to the platform's core technology.","technologies":["Blockchain","ReactJS","TypeScript","EOS","AWS"],"link":"https://example.com/emanate","image":"https://gaboesquivel.com/images/work/emanate.png","video":"https://www.youtube.com/watch?v=VXSrROohhyA"},{"title":"Make Sense Labs Inc","description":"Sense.chat, developed by Sense, a blockchain and DeFi company, is a secure chat and transaction app focusing on user data privacy.\n My role at Sense involved enhancing the React Native app's performance and integrating it with the EOS mainnet for token functionality.","technologies":["React Native","TypeScript","Blockchain","EOS"],"link":"https://www.youtube.com/watch?v=2DJxzYDaAz8","image":"https://gaboesquivel.com/images/work/sense-chat.png","video":"https://www.youtube.com/watch?v=2DJxzYDaAz8"},{"title":"EOS Costa Rica","description":"EOS Costa Rica provides infrastructure for EOSIO blockchains and custom smart contract development.\n Joining EOS Costa Rica at its inception, I played a key role in the EOS mainnet launch, managed validators for multiple networks, and helped establish the custom development services division. My major contribution included leading the architecture for a custom private blockchain for Grant Thornton.","technologies":["EOS","Smart Contracts","PostgreSQL","Containers","Cloud","NodeJS","GraphQL","ReactJS"],"link":"https://eoscostarica.io","image":"https://gaboesquivel.com/images/work/eoscostarica.png","repo":"https://github.com/eoscostarica","video":"https://www.youtube.com/watch?v=-1y0fGs8Xgw&"},{"title":"EOS Rate","description":"EOS Rate is a community-driven tool for rating EOS Block Producers, featuring a radial graph and community input stored on the blockchain.\n In this project, I was responsible for the technical architecture and selecting the appropriate technology.","technologies":["EOS","Smart Contracts","GraphQL","ReactJS"],"link":"https://eosrate.io","image":"https://gaboesquivel.com/images/work/eosrate.png","repo":"https://github.com/eoscostarica/eos-rate","video":"https://www.youtube.com/watch?v=saZnZqJsMhk"},{"title":"Knowledge.io","description":"Knowledge is a platform that rewards users for sharing information, recognized through a token system.\n My role at Knowledge included leading the architecture of the token and supporting systems for a successful ICO, and forming a skilled development team.","technologies":["Ethereum","Smart Contracts","AWS","Serverless","GraphQL","React Native","React","Node.js","Jenkins"],"link":"https://github.com/knowledge/ethereum-contracts","image":"https://gaboesquivel.com/images/work/knowledge.png","repo":"https://github.com/knowledge"},{"title":"ChainGraph","description":"This real-time GraphQL toolkit is designed for EOSIO/Antelope blockchain applications, offering features like data subscriptions and querying multiple blockchains.\n As a personal side project during my time at Bitcash, I was responsible for the architectural design, technology selection, and coding of the toolkit, including a real-time blockchain data streaming package.","technologies":["EOSIO","Antelope","NodeJS","Docker","GraphQL","GCloud","RXJS","ReactJS"],"link":"https://chaingraph.io","image":"https://gaboesquivel.com/images/work/chaingraph.png","repo":"https://github.com/chaingraph"},{"title":"Fantasy Top Shots","description":"The mobile app game based on NBA Top Shot NFTs was developed for the 2022 Flow Hackathon. It leverages the popularity of NBA Top Shot NFTs to create an engaging gaming experience.\n My contribution to this project was in the game's design and development, utilizing my skills in blockchain technology and mobile app development.","technologies":["Flow Blockchain","ReactJS","React Native with Expo","Tailwind"],"link":"https://fantasy-top-shot.vercel.app","image":"https://gaboesquivel.com/images/work/fantasy-top-shots.png","video":"https://www.youtube.com/watch?v=Il2aiKhy_ug","repo":"https://github.com/bitcashorg/fantasy-top-shot"},{"title":"Holepunch Playground","description":"Holepunch is a collection of JavaScript modules for creating P2P apps. It's an open repository for exploring different P2P patterns and functionalities.\n In this project, I initiated and maintained the repository, contributing to the development of various P2P app functionalities using JavaScript.","technologies":["NodeJS","Turbo","P2P","Hypercore","Hyperswarm","Hyperbee"],"link":"https://github.com/gaboesquivel/holepunch-playground","image":"https://gaboesquivel.com/images/work/holepunch-playground.png","repo":"https://github.com/gaboesquivel/holepunch-playground"},{"title":"SmartSale EVM","description":"SmartSale EVM, an EVM version of the Gnosis Smart Contract, facilitates multi-chain fund-raising with Dutch Auction functionality for fairer token distribution.\n My responsibilities included defining the technical architecture, selecting the technology stack, and planning the project roadmap.","technologies":["Antelope EVM","ReactJS","GraphQL ( subgraph )","Firehose streams"],"link":"https://pomelo.io/grants/smartsale","image":"https://gaboesquivel.com/images/work/smartsale-evm.webp","repo":"https://github.com/bitcashorg/smartevm"},{"title":"Substrate Contracts UI","description":"Substrate Contracts UI is a web application for deploying and interacting with WASM smart contracts on Substrate blockchains.\n I contributed to the project by enhancing code quality through multiple open-source contributions and gained experience in building dApps with Substrate.","technologies":["Polkadot","Substrate","ReactJS","Tailwind"],"link":"https://contracts-ui.substrate.io/","image":"https://gaboesquivel.com/images/work/contracts-ui.png","repo":"https://github.com/paritytech/contracts-ui"},{"title":"Wizard World","description":"A progressive web app connects to GPT3 to generate AI images and mint them on the Flow blockchain. This app integrates AI with blockchain technology.\n My role involved the app's development, focusing on integrating GPT3 for image generation and ensuring smooth functionality with the Flow blockchain.","technologies":["NextJS","Flow Blockchain","Niftory","GPT3","Tailwind"],"link":"https://wizart.world","image":"https://gaboesquivel.com/images/work/wizart-world.png","video":"https://www.youtube.com/watch?v=I_vBUflXHFA","repo":"https://github.com/bitcashorg/wizartworld"},{"title":"dBoard","description":"dBoard is a DAO decision-making and community management tool. It allows stakeholders to strategize, debate, and vote on actions for organizational efficiency.\n In this project, my contributions included overseeing the technical architecture and the smart contract development and integration on the webapp.","technologies":["Antelope","EOS","Smart Contracts","NextJS","GCloud","GraphQL"],"link":"https://eos.dboard.ai","image":"https://gaboesquivel.com/images/work/dboard.png","repo":"https://github.com/bitcashorg/bitcash-contract-dho"},{"title":"Wink","description":"Wink, Costa Rica's first neo-bank, offers a mobile app for online banking, eliminating the need for physical branch visits.\n I developed the first version of Wink's mobile app and backend services within AWS. My role involved API integration with partner banks and forming a dedicated development team.","technologies":["AWS","Serverless","ReactNative","React","NodeJS","Zero-Trust","Biometrics","Mocha","Chai"],"link":"https://holawink.com","image":"https://gaboesquivel.com/images/work/wink.png","video":"https://www.youtube.com/watch?v=rfeISMW_OVc"},{"title":"American Express","description":"The American Express website enables cardmembers to manage their financial accounts, offering features like balance checks, transaction views, and secure payments.\n My responsibility was focused on front-end development, including Object-Oriented JavaScript, AJAX for a fluid user experience, and implementing A/B Testing and usage analytics.","image":"https://gaboesquivel.com/images/work/amex.jpg","link":"https://www.americanexpress.com/","technologies":["JSP (Struts)","Omniture","Adobe mBox","Facebook API","Dojo","jQuery","CSS3"]},{"title":"AMEX Money Talk","description":"The National Money Night Talk by American Express aimed to promote financial communication between parents and teenagers.\n As a Frontend Engineer, I developed the campaign's landing page, focusing on user engagement and information delivery.","link":"https://www.youtube.com/watch?v=a2vDoYyXIJQ","image":"https://gaboesquivel.com/images/work/money-talk.jpg","technologies":["JavaScript","CSS3"]},{"title":"Elder Scrolls Online","description":"The official website serves as a central hub for a gaming community, offering news, game guides, and forums.\n My role was to ensure a user-centric design for the website, facilitating easy navigation and engagement with the content, blending aesthetics and functionality for a dynamic digital platform.","technologies":["PHP","JavaScript","jQuery","Facebook API","Twitter API"],"link":"http://elderscrollsonline.com","image":"https://gaboesquivel.com/images/work/elder-scrolls.jpg"},{"title":"AMC Yeah TV Facebook App","description":"An online movie streaming service allows watching movies in chapters with detailed information and interactive games.\n I was responsible for the frontend architecture design, integrating the game app with Facebook and the backoffice system with Brightcove web services for video streaming and editing.","technologies":["HTML5","PHP","Facebook API","AJAX","Facebook Credits","Handlebars","Brightcove API","require.js"],"link":"http://yeahtv.com","image":"https://gaboesquivel.com/images/work/yeahtv.jpg"},{"title":"Tikr","description":"Tikr is an online store with dynamic, real-time fluctuating prices, offering a unique shopping experience. It operates on the Ruby on Rails-based Spree backend framework.\n My role at Tikr encompassed full-stack development with a focus on frontend development and customization of the Spree backend framework.","link":"http://tikr.com","image":"https://gaboesquivel.com/images/work/tikr.jpg","technologies":["Ruby on Rails","Spree","Heroku","Postgres","jQuery","SASS/SCSS"]},{"title":"Eat Arcade","description":"I designed and developed an SMS subscription system featuring curated dishes from New York City's finest restaurants. The system offered a unique dining experience through mobile technology.\n My responsibilities covered the entire development process, from system design to implementation, showcasing my skills in mobile-based service development.","technologies":["NodeJS","Express.js","AngularJS","MongoDB","Heroku","Bootstrap","Stripe","Twilio"],"link":"http://www.eatarcade.com/","image":"https://gaboesquivel.com/images/work/eatarcade.jpg"},{"title":"Jockey Hollow Bar and Kitchen","description":"Jockey Hollow Bar and Kitchen, located in a historic mansion, features four distinct dining concepts. The responsive landing page I developed introduces visitors to its diverse culinary world.\n My work focused on developing the main responsive landing page, ensuring an inviting and informative digital gateway to the restaurant's offerings.","technologies":["SASS","jQuery","Lodash","Grapnel.js","Grunt","Node(Express)","Heroku","Divshot"],"link":"http://www.jockeyhollowbarandkitchen.com/","image":"https://gaboesquivel.com/images/work/jockey-hollow.png"},{"title":"Jockey Hollow Bar and Kitchen Menu Kiosk App","description":"At Jockey Hollow Bar & Kitchen, I developed the Menu Kiosk App, a responsive web application for tablet kiosks. It simplifies menu selection for patrons and uses Google Spreadsheets for easy updates.\n As the sole developer, my role involved creating an intuitive and efficient digital menu solution, enhancing the dining experience.","technologies":["SASS","jQuery","Lodash","Grapnel.js","Grunt","Node(Express)","Heroku","Divshot"],"link":"#","image":"https://gaboesquivel.com/images/work/jockey-hollow-menu.png"},{"title":"Bureau of Trade (Beta)","description":"Bureau of Trade (Beta) is an online store offering a range of products, with a frontend integrated with eBay's API for diverse shopping experiences.\n As the sole Fullstack developer, my focus was on frontend development, responsive design, and animations, along with eBay API integration.","link":"http://www.gridium.com/products/portfolio-manager/","image":"https://gaboesquivel.com/images/work/bureau-of-trade.jpg","technologies":["PHP","eBay API","HTML5","AJAX/jQuery"]},{"title":"Tractor Supply","description":"The Tractor Supply mobile app offers features like product browsing, exclusive offers, account management, and an augmented reality feature for product previews.\n As a consultant, I enhanced the app's performance and code quality, and developed its augmented reality feature, improving user experience and engagement.","technologies":["React Native","ReactJS","Containers","Cloud","NodeJS","TypeScript","Augmented Reality"],"link":"https://www.tractorsupply.com/tsc/cms/app","image":"https://gaboesquivel.com/images/work/tractor-supply.png"},{"title":"Photo and Go","description":"MyPhoto.com is an online platform for creating personalized photo products. I led the development of an innovative photo editor app and backend services integrated with existing e-commerce systems.\n My leadership role encompassed technical direction and execution, focusing on creating a smooth and intuitive user experience.","technologies":["ReactJS","NodeJS","Hapi","Swagger","Redux","AWS","Docker","Jenkins","PostgreSQL","Linux"],"link":"https://www.myphoto.com/","image":"https://gaboesquivel.com/images/work/photoandgo.jpg"},{"title":"4Tius Fitness Data Tracker","description":"The 4Tius app is a centralized platform for monitoring fitness data, integrating with Fitbit. It includes a web dashboard and API.\n As a Fullstack software engineer, I led the development of both the web application and backend systems, ensuring seamless integration and user-friendly functionality.","technologies":["Node.js","Express","AWS","Linux","MongoDB","Angular.js"],"link":"https://example.com/18techs","image":"https://gaboesquivel.com/images/work/4tius.jpg"},{"title":"SunTrust","description":"SunTrust's Solid Salutes campaign facilitated user-generated custom video salutes. I developed the entire campaign website, focusing on design and user interaction.\n My role included overseeing the website's development from concept to implementation, emphasizing user engagement and visual appeal.","link":"#","image":"https://gaboesquivel.com/images/work/suntrust-1.jpg","technologies":["JavaScript","CSS3"]},{"title":"ScotiaTico","description":"For ScotiaBank Costa Rica, I developed the ScotiaTico newsletter, a communication tool for bank updates and information.\n My responsibility was crafting an engaging and informative newsletter layout, enhancing communication between the bank and its customers.","link":"#","image":"https://gaboesquivel.com/images/work/scotiatico.jpg","technologies":["JavaScript","CSS3","Wordpress"]},{"title":"Staples","description":"At Staples, a retail store for office supplies, I worked on building responsive features and the main website navigation.\n My role as a frontend developer involved creating user-friendly and efficient navigation elements, contributing to the overall user experience on the website.","link":"#","image":"https://gaboesquivel.com/images/work/staples.jpg","technologies":["JavaScript","CSS3","Mootols"]},{"title":"Gridium","description":"Gridium is an energy data analytics prototype for visualizing and analyzing energy consumption. It aids in informed energy management decisions.\n I built the first version of the application, focusing on displaying data collected from various buildings, showcasing my skills in data visualization.","link":"https://gridium.com/","image":"https://gaboesquivel.com/images/work/gridium.png","technologies":["JavaScript","Data Charts","CSS","Bootstrap"]},{"title":"ARINC Microfids","description":"ARINC Microfids is a flight information display system for hotels and airport businesses. It integrates with a Ruby on Rails backend.\n My responsibilities included frontend development and system integration, ensuring a seamless display of flight information.","image":"https://gaboesquivel.com/images/work/arinc.png","technologies":["Ruby on Rails","AngularJS","Faye","LESS","Heroku"]},{"title":"Capoeira Abolicao","description":"Capoeira Abolição is a Brazilian martial arts group. I volunteered to create their promotional website, showcasing their professors and community.\n My involvement included website design and development, highlighting the group's activities and global presence.","link":"https://capoieraabolicao.com","image":"https://gaboesquivel.com/images/work/abolicao.jpg","technologies":["JavaScript","Wordpress","CSS","Bootstrap"]},{"title":"Panini","description":"Panini, a project I worked on, provided a unique service or product in its field.\n My role in this project was focused on technical development and implementation, aligning with the project's goals and requirements.","link":"#","image":"https://gaboesquivel.com/images/work/panini.jpg","technologies":["JavaScript","CSS3","Wordpress"]},{"title":"Earth","description":"EARTH University offers education in agricultural sciences. I was responsible for building their main website, blog, and newsletter.\n My work involved creating a digital platform for information dissemination and community engagement, focusing on usability and content management.","link":"#","image":"https://gaboesquivel.com/images/work/wordpress-earth-pai.jpg","technologies":["JavaScript","CSS3","Wordpress"]},{"title":"Proparques","description":"ProParques is a nonprofit for national park sustainability. I developed their responsive landing page and an interactive national park map.\n My role included web design and development, focusing on user interaction and information accessibility for park exploration.","link":"#","image":"https://gaboesquivel.com/images/work/proparques.jpg","technologies":["JavaScript","CSS3","Wordpress"]},{"title":"Fantasy Tennis","description":"FanSlam Fantasy Tennis is a strategic game for ATP, WTA, and Grand Slam tournaments. I designed and built both the frontend and backend.\n As a fullstack developer, my work encompassed creating an engaging and functional gaming experience, integrating strategy and user interface design.","link":"https://www.fanslam.us","image":"https://gaboesquivel.com/images/work/fantasy-tennis.jpg","technologies":["JavaScript","CSS3"]},{"title":"Mobtion","description":"Mobtion agency specializes in mobile development services. I designed and developed their responsive website and WordPress CMS.\n My responsibilities included website design, development, and ensuring seamless content management for the agency.","link":"#","image":"https://gaboesquivel.com/images/work/mobtion.jpg","technologies":["JavaScript","CSS3","Wordpress","PHP"]},{"title":"ITS","description":"ITS InfoCom, an IT multinational, focuses on Remote Infrastructure Management. I implemented their primary website, CMS, and CRM integration.\n My role was to create and integrate digital solutions for the company, focusing on web presence and customer relationship management.","link":"#","image":"https://gaboesquivel.com/images/work/website-its.jpg","technologies":["JavaScript","CSS3","PHP","Custom CMS"]},{"title":"Trivenzor","description":"For Trivenzor, a hypertension medication, I developed a responsive landing page for patient and healthcare provider information.\n My work involved creating a user-friendly and informative digital platform, emphasizing medical information clarity and accessibility.","link":"#","image":"https://gaboesquivel.com/images/work/tribenzor.jpg","technologies":["JavaScript","CSS3","Mootols"]},{"title":"Living with Dryness","description":"The Living with Dryness project involved crafting a responsive landing page focused on providing information and resources.\n As the developer, I ensured a pixel-perfect design and user-friendly navigation, catering to the project's specific audience and needs.","link":"#","image":"https://gaboesquivel.com/images/work/living-with-dryness.jpg","technologies":["JavaScript","CSS3","Wordpress"]}]